package homework_exec_3_repetitions;

//import java.util.Scanner;

public class Exec_3 {

	public static void main(String[] args) {

//		Scanner input = new Scanner(System.in);
//		
//		System.out.print("Please, enter word: ");
//		String text = input.nextLine();
//		System.out.print("Please, enter text: ");
//		String word = input.nextLine();
//		
//		input.close();
					
		String text = "Възторжената и светла душа на Люцкана беше създадена за \n"
				+ "свърталище на любовта. И наистина, като всеки поет, той беше безумно \n"
				+ "влюбен, и то в най-хубавото момиче в града - Цветана. Тя беше дъщеря на \n"
				+ "един от най-първите чифликчии в околността. По една отколешна традиция, която \n"
				+ "заможните семейства още пазеха, Цветана се учеше в Роберт колеж в Цариград, но всяка \n"
				+ "ваканция прекарваше тука. Тя беше хубаво момиче, мургава, с черни и замислени очи на сърна, \n"
				+ "с една доста едра луничка на едната си буза. В града може би имаше по-хубави момичета от нея. \n"
				+ "Но туй, което липсваше на тях, а всички виждаха у Цветана, беше тая непринудена грация, това \n"
				+ "тънко благородство и достойнство, което идеше от цялото й същество. Тя не дружеше почти с никого, \n"
				+ "намираха я надменна и горда, говореха зле за нея. Но приятел или враг, млад или възрастен, човек не \n"
				+ "можеше да не се загледа в това момиче, което само като че не виждаше никого, пристъпваше бавно, \n"
				+ "съсредоточено в себе си, чуждо на всичко околно - гордата и недостъпна самотност на царкиня, доведена \n"
				+ "от далечна земя.";
		
		String word = "Цветана";
		
		int counter = -1;
		int position = -1;
		
		do {
			position = text.indexOf(word, position+1);
			++counter;
		} while (position != -1);
		
		System.out.printf("Number of \"%s\" hits: %d", word, counter);
		
	}

}
